Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S2A.atdf
          </instance>
        </module>
        <module name="CRCCU" version="11001I">
          <instance name="CRCCU">
            <register-group address-space="base" name="CRCCU" name-in-module="CRCCU" offset="0x40044000"/>
          </instance>
        </module>
        <module name="EFC" version="6450X">
          <instance name="EFC0">
            <register-group address-space="base" name="EFC0" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378H">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="MATRIX" version="6499B">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="11004U">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal pad="PA23" function="X1" group="PIODCCLK"/>
              <signal pad="PA24" function="X1" group="PIODC" index="0"/>
              <signal pad="PA25" function="X1" group="PIODC" index="1"/>
              <signal pad="PA26" function="X1" group="PIODC" index="2"/>
              <signal pad="PA27" function="X1" group="PIODC" index="3"/>
              <signal pad="PA28" function="X1" group="PIODC" index="4"/>
              <signal pad="PA29" function="X1" group="PIODC" index="5"/>
              <signal pad="PA31" function="X1" group="PIODC" index="7"/>
              <signal pad="PA30" function="X1" group="WKUP" index="11"/>
              <signal pad="PA30" function="X1" group="PIODC" index="6"/>
              <signal pad="PA15" function="X1" group="WKUP" index="14"/>
              <signal pad="PA15" function="X1" group="PIODCEN" index="1"/>
              <signal pad="PA16" function="X1" group="WKUP" index="15"/>
              <signal pad="PA16" function="X1" group="PIODCEN" index="2"/>
            </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
        </module>
        <module name="PMC" version="11116V">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343T">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA9" function="C" group="PWMFI" index="0"/>
              <signal pad="PA10" function="C" group="PWMFI" index="1"/>
              <signal pad="PA18" function="D" group="PWMFI" index="2"/>
              <signal pad="PA0" function="A" group="PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PC18" function="B" group="PWMH" index="0"/>
              <signal pad="PA1" function="A" group="PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PC19" function="B" group="PWMH" index="1"/>
              <signal pad="PA2" function="A" group="PWMH" index="2"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMH" index="2"/>
              <signal pad="PC20" function="B" group="PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PB14" function="B" group="PWMH" index="3"/>
              <signal pad="PC21" function="B" group="PWMH" index="3"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWML" index="0"/>
              <signal pad="PC13" function="B" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PC1" function="B" group="PWML" index="1"/>
              <signal pad="PC15" function="B" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PC2" function="B" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
              <signal pad="PC3" function="B" group="PWML" index="3"/>
              <signal pad="PC22" function="B" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009J">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
